{
	"lgHomeButton": "Home",
	"lgAboutButton": "About Me",
	"lgResumeButton": "Experience",
	"lgEducationButton": "Education",
	"lgLanguagesButton": "Languages",
	"lgSkillsButton": "Skills",
	"lgPortfolioButton": "Projects",
	"lgHobbiesButton": "Hobbies",
	"lgAboutMe": "I am a Quality Assurance Analyst (QA) with over 4 years of experience and knowledge in development. I have many skills; I can collaborate as a Functional/Technical Analyst, Scrum Master, QA Automation, contribute to the auditing part of the IT area as I enjoy documenting and I am familiar with the area's procedures, or even serve as a Jira Administrator.",
	"lgScrollDown": "Scroll Down",
	"lgAboutMeOne": "I am of Japanese descent; my parents come from the beautiful island of Okinawa and came to Argentina when they were young. From a very young age, I have considered myself as a proactive person, with a strong drive for research and self-directed learning. I always seek to expand my knowledge and skills, even in areas where I am not an expert.",
	"lgAboutMeTwo": "I stand out for my ability to effectively communicate with my work environment and for my willingness to assist in any task, even if it's not within my area of expertise. Furthermore, I have a constant drive to enhance processes, both on an individual level and for the overall benefit of the company.",
	"lgAboutMeThree": "I began my professional career at the age of 18 in the hospitality sector, but I soon discovered my passion for the world of technology and computers. From that point on, I exclusively directed my work experience towards the field of information technology (IT).",
	"lgContactData": "Contact Information",
	"lgDownloadButton": "Download Resume",
	"lgDownloadButtonHref":"./data/CV - Cecilia Kuniyoshi.pdf",
	"lgJobs": "Experiences/Jobs",
	"lgJobTitleOne": "Manual and Automation QA",
	"lgMonthsRangeOne": "December 2021 - April 2023",
	"lgPrimaryJob": "I had the opportunity to work as the sole (QA) on the OMS project, which involved a web application. During this project, I gained experience using different tools that I was not previously familiar with. In addition to the basic QA tasks, I was also responsible for managing the testing environments, which included installing the versions to be tested and troubleshooting in case of errors in the environments. I had access to MySQL databases to review data. Through this project, I discovered my passion for testing in the services part, generating data for testing, and reviewing information in databases. I gained experience in service automation to generate massive data loads and created guides for the QA team. As the application acted as an intermediary between other applications, I had to familiarize myself with other projects and learn about them. During this project, I started using Cypress to practice automation, although due to time constraints, I couldn't fully dedicate myself to it. I also resumed using JMeter for performance and stress testing. We utilized TestRail for test case management.",
	"lgJobTitleTwo": "Manual QA",
	"lgMonthsRangeTwo": "January 2021 - November 2021",
	"lgTechnisysJob": "I was part of the Diners Club Ecuador project team, initially working alongside a colleague, but eventually taking on the project's responsibility on my own. My role involved conducting tests on both the web application and the mobile app. For test case management, we utilized Zephyr in Jira. I gained experience in handling the tools specific to Technisys, a canned product used in the project. Later, I joined the HSBC Argentina project, where I also worked independently. In this project, we developed the homebanking platform from scratch, so I was responsible for testing both the web and mobile platforms.",
	"lgMonthsRangeThree": "Abril 2019 - Septiembre 2020",	
	"lgTelectronicaJob": "Throughout my experience, I faced the challenge of conducting tests on multiple applications simultaneously, both in web and mobile environments. It was during this period that I ventured into my first automation using Robot Framework and Selenium, which I found to be very user-friendly and easy to grasp. In addition to my role as a Quality Control Analyst (QA), I provided support to key clients, creating application manuals and contributing to departmental documentation for internal and vendor audits. I gained access to development and production databases, allowing me to acquire knowledge about RFID technology and become acquainted with various hardware components involved.",	
    "lgMonthsRangeFour": "October 2017 - December 2018",
	"lgTsoftJob":"My formal experience as a Software Quality Assurance(QA) began at this consulting firm, where I worked on projects for Credicoop Bank. During my time at this bank, I participated in testing various applications, including web and mobile homebanking, as well as internal applications. Subsequently, I worked on a large-scale application that encompassed all aspects related to checks. Throughout this period, I gained knowledge in loading test cases using the HP ALM Quality Center tool and also became familiar with Jira. Additionally, I had the opportunity to run batch processes, perform queries, and test some services.",
	"lgJobTitleThree": "Software Quality Control Supervisor",
    "lgMonthsRangeFive": "April 2014 - September 2017",	
	"lgGecomJob": "When I joined this company, there was no testing department in place, so I took the initiative to establish one myself. Despite holding the title of 'Supervisor,' I did not have any staff under my supervision. The testing process was quite informal, with no established test cases, so I introduced the use of Testlink for test case management. We also lacked tools for issue tracking, so all communication was conducted through email. Within the company, there were desktop applications for business management (a comprehensive ERP system), an accounting system, and a payroll processing application. In addition to my testing responsibilities, I was also in charge of creating and maintaining application manuals, as well as providing customer support via email for non-subscribing clients.",	
	"lgEducationOne": "Systems Administration Technician",
	"lgInstituteOne": "Private Institute of the Argentine Chamber of Commerce",
	"lgYearsRangeOne": "2012 - 2014 - Incomplete",
	"lgCareerOne": "Degree focused on managing a systems department within a company, with minimal programming content. Due to work demands, I was unable to complete the program.",
	"lgEducationTwo": "Hotel Administration Technician",
	"lgInstituteTwo": "Tertiary Level Study Center No. 1",
	"lgYearsRangeTwo": "2005 - 2007 - Completed",
	"lgCareerTwo": "Career to manage all types of hosting.",
	"lgEnglish": "English",
	"lgEnglishDescription": "As of 2023, I am currently practicing with the Open English platform. I started in March at level 3 and am now at level 7, which corresponds to a B2 (upper-intermediate) level. My goal is to complete the entire platform this year, which consists of a total of 8 levels. I have a strong level in reading, writing, and listening comprehension. However, I am in the process of improving my speaking skills. Regarding private lessons, I have consistently maintained levels B1-B2.",
	"lgJapanese": "Japanese",
	"lgJapaneseDescription": "I have basic knowledge as I studied many years ago and haven't practiced since. Nonetheless, I continue to watch anime and listen to Jrock/Jpop (Japanese music) to keep from forgetting.",
	"lgSkillDescription": "I have acquired knowledge in several areas and continue to take courses on different online platforms. Although I haven't had the chance to apply all my knowledge and sometimes tend to forget certain details, I have the ability to efficiently search the internet and find the answers I need. Regarding programming languages, I possess knowledge, but so far, I have primarily used them for task automation.",
	"lgAutomation": "Automation",
    "lgPythonPytestSelenium": "Selenium with Python and Pytest.",
	"lgRobotFramework": "Robot Framework with Selenium.",	
	"lgDataBases": "Data Bases",
	"lgProgrammingLanguages": "Programming Languages",
    "lgDesign": "Design", 
	"lgQaTools": "Tools Used in QA",
	"lgScrum":"Scrum Methodology",
	"lgSomeProjects": "Some of My Projects/Ideas",
	"lgCypressExampleOne": "Automation with Cypress example 1",
	"lgCypressOneDescription":"Test cases with Cypress and some validations of the web page: 'Sauce Demo'.",
	"lgLinkProject": "Project Link",
	"lgCypressExampleTwo": "Automation Cypress with Cucumber",
	"lgCypressTwoDescription": "Short Test with Cypress and Cucumber to Test Gherkin Format.",
	"lgCypressExampleThree": "Cypress Automation Demo",
	"lgCypressThreeDescription": "Cypress Demonstration with Test Page 'Nop Commerce'.",
	"lgPythonSelenium": "Automation with Python and Selenium",
	"lgPythonSeleniumDesc": "First Automation Project with Python, Selenium, and Pytest, Using the Test Page: 'Nop Ecommerce'.",
	"lgAPIS": "Automated APIs",
	"lgAPISdesc": "Automated APIs with Postman",
	"lgDraws": "Drawings and Illustrator",
	"lgDrawsDesc": "Drawings on Old Paper and Pizza Party in Illustrator.",
	"lgApisPython": "APIs with Python",
	"lgApisPythonDesc": "Example of a Smoke Test Using the Python 'requests' Library.",
	"lgGherkin": "Using Gherkin for Test Cases",
	"lgGherkinDesc": "Traditional Test Cases vs. Gherkin Format.",
	"lgConstruction": "Under Construction...",
	"lgHobbiesDescOne":"I enjoy everything related to Japanese and Korean culture. Anime, reading manga and manhwas, drawing on paper and digitally. I like listening to music, especially rock from the 60s to 2000s, Japanese music (Jpop/Jrock), and Korean pop.", 
	"lgHobbiesDescTwo":"Another hobby of mine is playing computer video games, especially survival and graphic adventure genres. When it comes to movies and TV series, I'm a fan of thought-provoking ones, the paranormal, fantasy, and time travel. Something you'll always find me doing is taking courses; I love learning about everything. And something very important, I'm a fan of The Simpsons up to season 11.",
	"lgFooterDesc": "The brands, logos, and trade names mentioned belong to their respective owners."
	
	
	
	
	
	
	
}