{
	"lgHomeButton": "Inicio",
	"lgAboutButton": "Acerca de mí",
	"lgResumeButton": "Experiencia",
	"lgEducationButton": "Educación",
	"lgLanguagesButton": "Idiomas",
	"lgSkillsButton": "Conocimientos",
	"lgPortfolioButton": "Proyectos",
	"lgHobbiesButton": "Hobbies",
	"lgAboutMe": "Soy Analista de Control de Calidad (QA) con más de 4 años de experiencia y conocimientos en desarrollo. Tengo muchos talentos, puedo colaborar como Analista funcional/técnico, Scrum Master,QA Automation, contribuir con la parte de auditoría del área de IT ya que me gusta documentar y conozco los procedimientos del área o bien, Jira Administrator.",
	"lgScrollDown": "Ir hacia abajo",
	"lgAboutMeOne": "Soy una persona con ascendencia japonesa, mis padres proceden de la hermosa isla de Okinawa y vinieron a Argentina cuando eran pequeños. Desde muy joven, me he considerado una persona proactiva, con un fuerte impulso de investigación y aprendizaje autodidacta. Siempre busco ampliar mis conocimientos y habilidades, incluso en áreas en las que no soy experta.",
	"lgAboutMeTwo": "Me destaco por mi habilidad para comunicarme efectivamente con mi entorno de trabajo y por mi voluntad de ayudar en cualquier tarea, incluso si no está dentro de mi área de especialización. Además, siento una constante necesidad de mejorar los procesos, tanto a nivel individual como para beneficio de la empresa en su conjunto.",
	"lgAboutMeThree": "Comencé mi carrera laboral a los 18 años en el sector de la hotelería, pero pronto descubrí mi pasión por el mundo de la tecnología y las computadoras. A partir de ese momento, enfoqué mi experiencia    laboral exclusivamente en el campo de la tecnología de la información (IT).",
	"lgContactData": "Datos de contacto",
	"lgDownloadButton": "Descargar cv",
	"lgDownloadButtonHref":"./data/CV - Cecilia Kuniyoshi - 2023.pdf",
	"lgJobs": "Trabajos",
	"lgJobTitleOne": "QA Manual y Automation",
	"lgMonthsRangeOne": "Diciembre 2021 - Abril 2023",
	"lgPrimaryJob": "Tuve la oportunidad de desempeñarme como única (QA) en el proyecto OMS, que consistía en una aplicación web. Durante este proyecto, adquirí experiencia en el uso de diversas herramientas que no conocía previamente. Además de las tareas básicas de un QA, también fui responsable de gestionar los diferentes entornos de pruebas, lo cual implicaba la instalación de las versiones a probar y la resolución de problemas en caso de errores en los entornos. Tuve acceso a las bases de datos MySQL para revisar los datos. A través de este proyecto, descubrí mi pasión por realizar pruebas en la parte de servicios, generando datos para las pruebas y revisando la información en las bases de datos. Adquirí experiencia en la automatización de servicios para generar cargas masivas de datos y creé instructivos para el equipo de QA. Dado que la aplicación actuaba como intermediaria entre otras aplicaciones, tuve que familiarizarme con otros proyectos y aprender sobre ellos. Durante este proyecto, comencé a utilizar Cypress para practicar la automatización, aunque debido a limitaciones de tiempo no pude dedicarme completamente a ello. También retomé el uso de JMeter para realizar pruebas de rendimiento y estrés. Utilizamos TestRail para la carga de los casos de prueba.",
	"lgJobTitleTwo": "QA Manual",
	"lgMonthsRangeTwo": "Enero 2021 - Noviembre 2021",
	"lgTechnisysJob": "Formé parte del equipo del proyecto Diners Club Ecuador, inicialmente trabajé junto a una compañera, pero finalmente asumí la responsabilidad del proyecto en solitario. Mi labor consistía en realizar pruebas tanto en la aplicación web como en la aplicación móvil. Para la gestión de los casos de prueba, utilizamos Zephyr en Jira. Adquirí experiencia en el manejo de las herramientas propias de Technisys, un producto enlatado utilizado en el proyecto. Posteriormente, me incorporé al proyecto HSBC Argentina, donde también trabajé de manera independiente. En este proyecto, se desarrolló el homebanking desde cero, por lo que tuve la      responsabilidad de realizar pruebas en la plataforma web y móvil.",
	"lgMonthsRangeThree": "Abril 2019 - Septiembre 2020",	
	"lgTelectronicaJob": "Durante mi experiencia, tuve el desafío de realizar pruebas de múltiples aplicaciones simultáneamente, tanto en entornos web como móviles. Fue en este período cuando realicé mi primera automatización utilizando Robot Framework y Selenium, los cuales encontré muy amigables y fáciles de entender. Adicionalmente a mi rol como Analista de Control de Calidad (QA), brindé soporte a importantes clientes, creando manuales de las aplicaciones y colaborando en la documentación del área para auditorías internas y de proveedores. Tuve acceso a las bases de datos de desarrollo y producción, lo que me permitió adquirir conocimientos sobre tecnología RFID y familiarizarme con los diferentes hardwares involucrados.",						
	"lgMonthsRangeFour": "Octubre 2017 - Diciembre 2018",
	"lgTsoftJob":"Mi experiencia formal como Analista de Control de Calidad (QA) comenzó en esta consultora, donde trabajé en proyectos para el banco Credicoop. Durante mi tiempo en este banco, participé en la prueba de diversas aplicaciones, incluyendo el homebanking web y móvil, así como también aplicaciones internas. Posteriormente, trabajé en una aplicación de gran envergadura que abarcaba todo lo relacionado con cheques.             Durante este periodo, adquirí conocimientos en la carga de casos de prueba utilizando la herramienta HP ALM Quality Center, y también me familiaricé con Jira. Además, tuve la oportunidad de ejecutar procesos batch, realizar consultas (queries) y probar algunos servicios.",
	"lgJobTitleThree": "Supervisora de Control de Calidad de Software",
    "lgMonthsRangeFive": "Abril 2014 - Septiembre 2017",	
	"lgGecomJob": "Cuando me uní a esta empresa, no existía un departamento de testing, por lo que comencé a establecerlo yo misma. Aunque mi título era de 'Supervisora', no tenía personal a cargo. El proceso de testing era muy informal, no se contaban con casos de prueba establecidos, así que implementé el uso de Testlink para su gestión. Tampoco teníamos herramientas para el seguimiento de incidencias, por lo que toda la comunicación se realizaba a través de correo electrónico. En la empresa, había aplicaciones de escritorio para la administración de empresas (un ERP bastante completo), un sistema contable y una aplicación de liquidación de sueldos. Además de mis responsabilidades en el testing, también me encargaba de crear y mantener los manuales de las aplicaciones, así como de brindar soporte por correo electrónico a los clientes sin abono.",
	"lgEducationOne": "Tecnicatura en Administración de Sistemas",
	"lgInstituteOne": "Instituto Privado de la Cámara Argentina de Comercio",
	"lgYearsRangeOne": "2012 - 2014 - Incompleto",
	"lgCareerOne": "Carrera orientada a administrar un área de sistemas en una empresa, de programación tenía muy poco. Por exigencias laborales no pude finalizar la carrera.",
	"lgEducationTwo": "Tecnicatura en Administración Hotelera",
	"lgInstituteTwo": "Centro de estudios a Nivel Terciario N°1",
	"lgYearsRangeTwo": "2005 - 2007 - Finalizado",
	"lgCareerTwo": "Carrera para administrar todo tipo de hospedaje.",
	"lgEnglish": "Inglés",
    "lgEnglishDescription": "Actualmente, en 2023, estoy practicando con la plataforma de Open English. Comencé en marzo en el nivel 3 y ahora me encuentro en el nivel 7, que equivale a un nivel B2 (intermedio superior). Mi objetivo es completar toda la plataforma este año, que consta de 8 niveles en total. Tengo un buen nivel en lectura (reading), escritura (writing) y comprensión auditiva (listening), sin embargo, estoy en proceso de mejorar mi nivel de expresión oral (speaking). En cuanto a cursos particulares, siempre me he mantenido en los niveles B1-B2.",
	"lgJapanese": "Japonés",
	"lgJapaneseDescription": "Tengo conocimientos básicos, ya que estudié hace muchos años y no he vuelto a practicar, aún así sigo viendo animé y escucho Jrock/Jpop (música en japonés) para no olvidarme.",
    "lgSkillDescription": "He adquirido conocimientos en diversas áreas y continúo realizando cursos sobre diferentes herramientas. Aunque no he tenido la oportunidad de poner en práctica todos mis conocimientos y a veces tiendo a olvidar ciertos detalles, tengo la habilidad de buscar eficientemente en Internet y encontrar las respuestas que necesito. En cuanto a los lenguajes de programación, poseo conocimientos, pero hasta ahora los he utilizado principalmente para la automatización de tareas.",
	"lgAutomation": "Automatización",
    "lgPythonPytestSelenium": "Python con Selenium y Pytest.",
	"lgRobotFramework": "Robot Framework con Selenium.",	
	"lgDataBases": "Base de datos",
	"lgProgrammingLanguages": "Lenguajes de Programación",
    "lgDesign": "Diseño", 
	"lgQaTools": "Herramientas utilizadas en QA",
	"lgScrum":"Metodología Scrum.",
	"lgSomeProjects": "Algunos de mis proyectos/ideas",
	"lgCypressExampleOne": "Automation con Cypress ejemplo 1",
	"lgCypressOneDescription":"Test cases con Cypress y algunas validaciones de la página: 'Sauce Demo'.",
	"lgLinkProject": "Link al proyecto",
	"lgCypressExampleTwo": "Automation Cypress y Cucumber",
	"lgCypressTwoDescription": "Breve prueba con Cypress y Cucumber para probar el formato Gherkin.",
	"lgCypressExampleThree": "Demo automatización con Cypress",
	"lgCypressThreeDescription": "Demostración de Cypress con la página de pruebas 'Nop Commerce'.",
	"lgPythonSelenium": "Automatización con Python y Selenium",
	"lgPythonSeleniumDesc": "Primer proyecto de automatización con Python, Selenium y Pytest, utilizando la página de prueba: 'Nop Ecommerce'.",
	"lgAPIS": "APIS automatizadas",
	"lgAPISdesc": "Automatización de APIS con Postman",
	"lgDraws": "Dibujos e Illustrator",
	"lgDrawsDesc": "Dibujos en papel viejos y pizza party en illustrator.",
	"lgApisPython": "APIS con Python",
	"lgApisPythonDesc": "Ejemplo de un smoke test con la librería requests de Python.",
	"lgGherkin": "Uso de Gherkin para casos de prueba",
	"lgGherkinDesc": "Casos de pruebas tradicionales versus con formato Gherkins.",
	"lgConstruction": "En contrucción...",
	"lgHobbiesDescOne":"Me gusta todo lo relacionado a la cultura japonesa y coreana. Animé, leer mangas y manhwas, dibujar en papel y digital. Escuchar música, sobretodo todo el género de rock de los 60's a 2000, música japonesa (Jpop/Jrock) y el pop coreano.",
	"lgHobbiesDescTwo": "Otro pasatiempo es jugar videojuegos en la computadora, del estilo survival y aventuras gráficas. En cuanto a películas y series soy fan de las que te hacen pensar, las paranormales, fantasía y viajes en el tiempo. Otra cosa que siempre me van a ver haciendo, son cursos, me gusta aprender de todo. Y algo muy importante, me gustan los Simpsons hasta la temporada 11.",
	"lgFooterDesc": "Las marcas, logos y nombres comerciales mencionados pertenecen a sus respectivos propietarios."
	
	
	
	
	
	
	
}